(function () {
    let p = new ReaderParam()
    let bookNum = 1012
    p.bookIndex = bookNum
    p.bookTitle = '第二次崩坏'
    p.bookMode = 'rl'
    p.editorNote = {
        zh: '- <a href="https://detail.tmall.com/item.htm?id=618270891041">官方实体版漫画</a>'
            + '</br>- 对应的「崩坏教室」：'
            + '<a href="https://mp.weixin.qq.com/s/oLbvxNNRTXxXmPLqHkWi9Q">【1】</a>'
            + '　<a href="https://mp.weixin.qq.com/s/niiuVwLtA3cxpeeYmL6N-g">【2】</a>'
            + '　<a href="https://mp.weixin.qq.com/s/5oYo_SzlPHotRYdCp0lMCA">【3】</a>'
            + '　<a href="https://mp.weixin.qq.com/s/ENDKTDbH1hA17as0mExuJA">【4】</a>'
            + '　<a href="https://mp.weixin.qq.com/s/k3RIHTMfsaTgMUDxX0JasA">【5】</a>'
            + '</br>- <a href="https://mp.weixin.qq.com/s/Xi6l2aogDH6vl1xk_zMhJg">官方总结</a>'
            + '</br>- 目录样式参考了实体版漫画。'
    }
    //楔子 https://mp.weixin.qq.com/s/EZjMAmxw3lEco25k7yMuww
    //第一话 https://mp.weixin.qq.com/s/4HUY5ihIXZ5ZgAkNnX5-RQ
    //第四十六话 https://mp.weixin.qq.com/s/hN3DVqwX0nZUj4FDhiNzgw
    let prefix = Util.getImgSrcPrefix()
    p.bookCoverSrc = prefix + 'book_cover/' + bookNum + '.jpg'
    p.imgSrcPrefix = prefix + 'book/' + bookNum + '/'
    p.chCoverSrcPrefix = prefix + 'chapter_cover/' + bookNum + '/'
    p.bgSrc = [
        prefix + 'book_cover/1012.jpg',
        "https://uploadstatic.mihoyo.com/bh3-wiki/2021/11/10/91006211/7b2bd0ef17554e450b812a9fb364561a_8625685736910547678.jpg",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2021/11/10/91006211/3c42231039016e6906f37aebb0088c9b_7684177201338486388.jpg",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2021/11/10/50494840/4a0475a7a9b081ae19e103184255a67b_2479751850797598116.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/02/75216984/cf341f716bfcf0c8bd7aa8efdba07022_1651609433147045410.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/02/75216984/60c205fa47b08fce09a16bf2aeeb7bc5_7583773384119096506.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/09/75216984/916d853b4d9465677a4e42268937258f_3988821227462846482.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/09/75216984/a229e075e03f73777f1d61dbba8fd1ff_390671701919617898.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/09/75216984/28851f33bc42c7fe7c3bb8172dd09dbc_7544989359286400664.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/09/75216984/685210c3fc9b989becda07ba60622f0c_1965773974523564797.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/09/75216984/15f77156cb373ed51829b8e5833e23e1_6258187768529814798.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/09/75216984/19096d625d949999a828adea0e0e805e_4399740643736864615.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/09/75216984/904aa318732d5475b3f104889d613af9_4866521674275430193.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/01/09/75216984/5a7cdf0557fc2dcc84761aa1a8b02e5c_7714392292958497934.png",
        "https://uploadstatic.mihoyo.com/bh3-wiki/2022/12/26/75216984/402702df7ce88dcc1d0e8fbcd099bf01_8057483723313025755.png",
    ]
    p.numChapter = 67
    p.chTitles = [
        "楔子 诡变",
        "第一话 鬼魂", "第二话 少女", "第三话 开战", "第四话 结盟", "第五话 撕裂",
        "第六话 破茧", "第七话 空间", "第八话 律者", "第九话 名字", "第十话 对决",
        "第十一话 小丑", "第十二话 少年", "第十三话 护送", "第十四话 游戏", "第十五话 礼物",
        "第十六话 约定", "第十七话 旧梦", "第十八话 神谕", "第十九话 苍月", "第二十话 双雄",
        "第二十一话 计划", "第二十二话 离别", "第二十三话 去月球", "第二十四话 揭幕", "第二十五话 鏖战",
        "第二十六话 牺牲", "第二十七话 最后一战", "第二十八话 一去不回", "壁纸精选", "第二十九话 女王归来", "第三十话 律者袭来",
        "第三十一话 反击号角", "第三十二话 战前演说", "第三十三话 魂钢之秘", "第三十四话 剑心", "第三十五话 随风而逝",
        "第三十六话 羽渡尘", "第三十七话 执念", "第三十八话 血缘", "第三十九话 代价", "第四十话 可可利亚",
        "第四十一话 救世之战", "第四十二话 燃烧冻土", "第四十三话 夙愿", "第四十四话 灵魂", "第四十五话 神",
        "第四十六话 太虚剑神", "第四十七话 斩断", "第四十八话 玩具", "第四十九话 和平", "壁纸精选II", "第五十话 家",
        "第五十一话 拥抱", "第五十二话 最后一搏", "第五十三话 贝纳勒斯", "第五十四话 屠龙", "第五十五话 梦醒",
        "第五十六话 赌局", "第五十七话 集结", "第五十八话 伤痛", "第五十九话 无限回廊", "第六十话 异变",
        "第六十一话 压制", "壁纸精选III", "最终话 守护", "后日谈 归处"
    ]
    p.chPages = [
        24, 18, 23, 18, 30,
        22, 25, 29, 21, 27,
        21, 26, 27, 29, 19,
        20, 18, 25, 40, 19,
        21, 21, 22, 16, 19,
        17, 20, 18, 21, 30,
        26, 20, 17, 18, 20,
        17, 18, 20, 20, 22,
        18, 19, 18, 17, 20,
        24, 23, 17, 20, 21,
        20, 32, 24, 23, 21,
        21, 21, 21, 21, 22,
        27, 23, 18, 22, 34,
        75, 22
    ]
    p.addBookFirstBlank()
    let noBlank = [2, 4, 5, 9, 12, 18, 29, 51, 64, 66]
    for (let i = 0; i < noBlank.length; i++) {
        p.bookModeBlank[noBlank[i]] = []
    }
    p.hiddenPages = null
    p.bgmInfo = [
        [[1, 2, 3], [0, 48, 73]],
        // 1-10
        4, [[5, 6], [0, 42]], 3, [[3, 25, 7], [0, 4, 61]], [[8, 11], [0, 24]],
        [[1, 26, 9], [0, 41, 58]], 9, 10, [[11, 27], [0, 19]], 27,
        // 11-20
        13, [[14, 3], [0, 26]], 15, 15, 16,
        16, 17, [[28, 8, 6], [0, 23, 38]], 8, 11,
        // 21-30
        11, 14, 14, 6, 13,
        26, 27, 27, -1, 6, 6,
        // 31-40
        6, [[18, 29], [0, 34]], 19, 20, 29,
        20, 11, 19, 11, 5,
        // 41-50
        [[11, 29], [0, 37]], 10, 21, 8, 8,
        21, [[21, 5], [0, 78]], 5, [[5, 14], [0, 25.5]], -1, 16,
        // 51-
        16, 12, 12, 8, 11,
        12, 12, [[29, 5], [0, 72]], 19, 27,
        27, -1, 22, 14
    ]
    p.bgmInfo2 = [
        [[1, 2, 3], [0, 12, 18]],
        // 1-10
        4, [[5, 6], [0, 11]], 3, [[3, 25, 7], [0, 3, 20]], [[8, 11], [0, 7]],
        [[1, 26, 9], [0, 10, 16]], 9, 10, [[11, 27], [0, 7]], 27,
        // 11-20
        13, [[14, 3], [0, 9]], 15, 15, 16,
        16, 17, [[28, 8, 6], [0, 11, 17]], 8, 11,
        // 21-30
        11, 14, 14, 6, 13,
        26, 27, 27, -1, 6, 6,
        // 31-40
        6, [[18, 29], [0, 8]], 19, 20, 29,
        20, 11, 19, 11, 5,
        // 41-50
        [[11, 29], [0, 8]], 10, 21, 8, 8,
        21, [[21, 5], [0, 16]], 5, [[5, 14], [0, 6]], -1, 16,
        // 51-
        16, 12, 12, 8, 11,
        12, 12, [[29, 5], [0, 20]], 19, 27,
        27, -1, 22, 14
    ]
    p.addBgmLoopInfo(28, 5, 23, 1, 1, true)
    p.bgmExtId = null
    p.voiceInfo = {
        // chaper: { page: num }
        // chaper: { page: [num, pos] }
        1: {
            3: 1, // c6-7
            4: 1, // c23-5
            14: 2, // c28-4
        },
        3: {
            8: [2, 58], // c24-11
            14: [1, 40], // c24-11
            15: 2, // c24-11
        },
        4: {
            10: [1, 46.5], // 德莉莎-战斗
        },
        6: {
            4: [1, 18], // c24-11
        },
        7: {
            9: 1, // c2-17
            12: 5, // c24-11
            13: 1, // c24-11
            14: 2, // c24-11
            15: 3, // c24-11
        },
        8: {
            13: 1, // BV1aW411P7UJ
            17: 1, // c2-17
            24: [1, 23], // 原神-温迪-战斗
        },
        10: {
            8: 1, // c9-3
            13: [1, 49.5], // c24-11
            18: 1, // c24-11
            //20: 1, // BV1H54y1y7wJ
            // 22: [1, 40.5], // c24-11
        },
        11: {
            7: 2, // c24-11
            8: 1, // c24-11
            //18: 1, // c11-15
        },
        12: {
            3: 1, // c11-15
        },
        13: {
            3: [1, 31], // c28-4
            25: 1, // c28-2
        },
        14: {
            8: 4, // c28-4
            9: 1, // c28-4
        },
        15: {
            10: [2, 39.5], // c28-4
            11: 3, // c28-4
            12: 1, // c28-4
        },
        18: {
            20: [2, 62], // c28-4
            21: [2, 27], // c28-4
        },
        19: {
            13: [1, 48], // c24-11
        },
        23: {
            // 8: [1, 58], // c11-15
            12: [1, 14.5], // c11-15
        },
        26: {
            2: [1, 19.5], // BV1aW411P7UJ
        },
        29: {
            //2: 1, // c11-15
        },
        38: {
            13: 1, // 符华-炽翎-战斗
        },
        45: {
            // 12: 1, // 符华-迅羽-战斗
            // 17: 1, // c24-11
        },
        46: {
            3: [1, 43], // c20
            4: 1, // c9-6
        },
        48: {
            // 14: 1, // BV1H54y1y7wJ
            //15: [1, 62.5], // c13-ex3
        },
        49: {
            //5: [1, 58], // BV1Ut411v74a
        },
        51: {
            3: 1, // c5-10
            19: [1, 54], // c24-11
            20: 2, // c24-11
        },
        53: {
            9: [1, 66], // c24-11
            10: 3, // c24-11
            11: 5, // c24-11
            12: 1, // c24-11
            14: 2, // c24-11
            15: 1, // c24-11
            17: [2, 33], // c24-11
        },
        54: {
            6: [1, 51.5], // c24-11
            7: [1, 31.5], // c24-11
            8: 2, // c24-11
            9: 3, // c24-11
            10: 1, // c24-11
            15: 1, // c24-11
            16: 4, // c24-11
            17: 1, // c24-11
            18: 2, // c24-11
            21: 1, // c24-11
        },
        55: {
            13: 1, // c12-1
        },
        57: {
            21: 1, // c17-10
        },
        58: {
            14: 3, // c24-11
        },
        60: {
            16: [2, 38], // c24-11
            17: 1, // c24-11
            21: 1, // c9-4
        },
        61: {
            10: 1, // c9-3
            19: 1, // c24-11
            20: 3, // c24-11
            21: 1, // c24-11
            22: 1, // c24-11
            23: [1, 57.5], // c24-11
        },
        64: {
            9: [1, 29], // BV1aW411P7UJ
        },
        66: {
            6: 2, // c24-11
            7: 2, // c24-11
            8: 1, // c24-11
            // 46: 1, // BV1H54y1y7wJ
            // 53: [1, 24.5], // BV1H54y1y7wJ
            44: 3, // c33-p3
            60: 2, // c28-4
            61: 3, // c28-4
            62: 3, // c28-4
            66: 1, // c24-11
            68: 3, // c24-11
            69: 2, // c24-11
            70: 1, // c24-11
            71: 1, // c24-11
        },
        67: {
            22: 1 // BV14X4y1w7P6
        }
    }
    p.i18nString = null
    p.i18nHtml = null
    let r = new Reader(p)
})();
